Players=('Hasan','Ahmad','Morteza','Vali','Payam')
print(Players)
for player in Players:
    print(player)
print("end of loop")
# تاپل در پایتون

# در این آموزش قصد داریم به دیتا تایپ tuple تاپل در پایتون بپردازیم.

# تاپل شباهتی زیادی به لیست در پایتون دارد چرا که مشابه با لیست نگهدارنده ای از مقادیر یا آبچکت ها می‌باشد که به صورت دنباله ای ذخیره شده و از طریق ایندکس قابل دسترسی هستند.

 
# شباهت های لیست با تاپل

#     هر دو نوع داده یک دنباله هستند
#     لیست و تاپل می‌توانند به عنوان نگهدارنده ی مجموعه از دیتا های دیگر باشند
#     لیست و تاپل هر دو مرتب هستند و به همین دلیل از طریق ایندکس قابل دسترسی هستند

 
# تفاوت های لیست با تاپل

#     لیست معمولا به عنوان نگهدارنده ای برای داده ها با تایپ یکسان استفاده می‌شود و در مقابل تاپل برای تایپ های متفاوت (الزامی وجود ندارد و هر دو می‌توانند هرنوع داده ای را نگهداری کنند)
#     تاپل برخلاف لیست یک دیتا تایپ Immutable است و پس از ایجاد شدن دیگر قابل تغییر نیست
#     تاپل کمی از لیست سریع تر است

# ساخت تاپل در پایتون

# در پایتون با استفاده از () یا فانکشن ()tuple می‌توانیم یک تاپل جدید ایجاد کنیم.

# نکته : در پایتون کاما یک تاپل ایجاد می‌کند و استفاده از پرانتز بجز هنگام ورودی دادن به فانکشن اختیاری است، به همین دلیل تمامی متغیر های کد زیر یک تاپل هستند.